artillery-tests/artillery-output-ci.txt
Test run id: tj3nq_wymrzfa9g3hx8yhbbaf7jd5r3ceyc_6hdg
Phase started: CI Performance Check (index: 0, duration: 60s) 23:11:52(+0000)

--------------------------------------
Metrics for period to: 23:12:00(+0000) (width: 7.114s)
--------------------------------------

http.codes.200: ................................................................ 189
http.downloaded_bytes: ......................................................... 6419483
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 189
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 16
  mean: ........................................................................ 4.2
  median: ...................................................................... 4
  p95: ......................................................................... 7.9
  p99: ......................................................................... 13.9
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 16
  mean: ........................................................................ 4.2
  median: ...................................................................... 4
  p95: ......................................................................... 7.9
  p99: ......................................................................... 13.9
http.responses: ................................................................ 189
vusers.completed: .............................................................. 53
vusers.created: ................................................................ 73
vusers.created_by_name.API endpoint check: ..................................... 22
vusers.created_by_name.Basic forum browsing: ................................... 51
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2008.2
  max: ......................................................................... 2060.1
  mean: ........................................................................ 2021.2
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2059.5


--------------------------------------
Metrics for period to: 23:12:10(+0000) (width: 9.619s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 9572516
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 34
  mean: ........................................................................ 3.5
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 15
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 34
  mean: ........................................................................ 3.5
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 15
http.responses: ................................................................ 300
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.API endpoint check: ..................................... 34
vusers.created_by_name.Basic forum browsing: ................................... 66
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2005.6
  max: ......................................................................... 2042.3
  mean: ........................................................................ 2015.1
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2018.7


--------------------------------------
Metrics for period to: 23:12:20(+0000) (width: 9.615s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 10877764
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 14
  mean: ........................................................................ 2.9
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 7
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 14
  mean: ........................................................................ 2.9
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 7
http.responses: ................................................................ 300
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.API endpoint check: ..................................... 22
vusers.created_by_name.Basic forum browsing: ................................... 78
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2005.4
  max: ......................................................................... 2051.4
  mean: ........................................................................ 2014.1
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2059.5


--------------------------------------
Metrics for period to: 23:12:30(+0000) (width: 9.613s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 9956756
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 37
  mean: ........................................................................ 3.1
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 7.9
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 37
  mean: ........................................................................ 3.1
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 7.9
http.responses: ................................................................ 300
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.API endpoint check: ..................................... 30
vusers.created_by_name.Basic forum browsing: ................................... 70
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2004.9
  max: ......................................................................... 2061.7
  mean: ........................................................................ 2013.7
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2059.5


--------------------------------------
Metrics for period to: 23:12:40(+0000) (width: 9.615s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 10833428
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 17
  mean: ........................................................................ 2.9
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 10.9
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 17
  mean: ........................................................................ 2.9
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 10.9
http.responses: ................................................................ 300
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.API endpoint check: ..................................... 25
vusers.created_by_name.Basic forum browsing: ................................... 75
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2005.4
  max: ......................................................................... 2027.8
  mean: ........................................................................ 2012.9
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2018.7


Phase completed: CI Performance Check (index: 0, duration: 60s) 23:12:52(+0000)

--------------------------------------
Metrics for period to: 23:12:50(+0000) (width: 9.618s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 10457108
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 11
  mean: ........................................................................ 2.8
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 7
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 11
  mean: ........................................................................ 2.8
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 7
http.responses: ................................................................ 300
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.API endpoint check: ..................................... 24
vusers.created_by_name.Basic forum browsing: ................................... 76
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2005.5
  max: ......................................................................... 2024.7
  mean: ........................................................................ 2012.5
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2018.7


--------------------------------------
Metrics for period to: 23:13:00(+0000) (width: 4.329s)
--------------------------------------

http.codes.200: ................................................................ 111
http.downloaded_bytes: ......................................................... 4249273
http.request_rate: ............................................................. 27/sec
http.requests: ................................................................. 111
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 14
  mean: ........................................................................ 4.1
  median: ...................................................................... 3
  p95: ......................................................................... 8.9
  p99: ......................................................................... 12.1
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 14
  mean: ........................................................................ 4.1
  median: ...................................................................... 3
  p95: ......................................................................... 8.9
  p99: ......................................................................... 12.1
http.responses: ................................................................ 111
vusers.completed: .............................................................. 47
vusers.created: ................................................................ 27
vusers.created_by_name.API endpoint check: ..................................... 6
vusers.created_by_name.Basic forum browsing: ................................... 21
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2006.1
  max: ......................................................................... 2031.5
  mean: ........................................................................ 2017
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2018.7


All VUs finished. Total time: 1 minute, 3 seconds

--------------------------------
Summary report @ 23:12:55(+0000)
--------------------------------

http.codes.200: ................................................................ 1800
http.downloaded_bytes: ......................................................... 62366328
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 1800
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 37
  mean: ........................................................................ 3.2
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 12.1
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 37
  mean: ........................................................................ 3.2
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 12.1
http.responses: ................................................................ 1800
vusers.completed: .............................................................. 600
vusers.created: ................................................................ 600
vusers.created_by_name.API endpoint check: ..................................... 163
vusers.created_by_name.Basic forum browsing: ................................... 437
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2004.9
  max: ......................................................................... 2061.7
  mean: ........................................................................ 2014.6
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2059.5
Log file: artillery-results-ci.json